# Pandas 03 - Set reset and use index.
Cambiar el indice por defecto de un DataFrame por una columna en especifico, ademas de poder reasignar el indice por defecto.

In [1]:
import pandas as pd

In [2]:
data = {
    'N_regs': [1,2,3,4,],
    'Name': ['Diana', 'Karime', 'Lain', 'Jane'],
    'Position': ['Teacher', 'Data Analyst', 'Pc master race', 'Security'],
    'Age': [25, 25, 22, 22]
}
df = pd.DataFrame(data)

Por defecto tenemos un DataFrame con los indices asignados por pandas, los cuales van en un rango de 0 a N.

In [3]:
df

   N_regs    Name        Position  Age
0       1   Diana         Teacher   25
1       2  Karime    Data Analyst   25
2       3    Lain  Pc master race   22
3       4    Jane        Security   22

Para crear un DataFrame e indicarle la columna que sera el nueva indice, se debe usar el metodo set_index('columna', inplace=True).
el metodo inplace=True se asegura de mantener los cambios

In [4]:
# en este caso, pasaremos la columna N_regs como indice del DataFrame
df.set_index('N_regs')

          Name        Position  Age
N_regs
1        Diana         Teacher   25
2       Karime    Data Analyst   25
3         Lain  Pc master race   22
4         Jane        Security   22

In [5]:
# si lo volvemos a imprimir veremos que los cambios no se mantienen
df

   N_regs    Name        Position  Age
0       1   Diana         Teacher   25
1       2  Karime    Data Analyst   25
2       3    Lain  Pc master race   22
3       4    Jane        Security   22

In [6]:
# para mantener los cambios en el DataFrame actual debemos usar inplace=True
df.set_index('N_regs', inplace=True)

In [7]:
# ahora los cambios se mantienen
df

          Name        Position  Age
N_regs
1        Diana         Teacher   25
2       Karime    Data Analyst   25
3         Lain  Pc master race   22
4         Jane        Security   22

Haciendo lo anterior, la columna N_regs deja de ser una columna y pasa a ser el indice de las filas, por lo cual ya no puede ser accesible por el nombre de la columna con loc.

In [8]:
# ahora podemos acceder por el entero o por el nombre (si lo tuviera)
df.loc[[1]]

         Name Position  Age
N_regs
1       Diana  Teacher   25

Para revertir el indice podemos hacer uso del metodo reset_index(inplace=True)

In [9]:
df.reset_index(inplace=True)

In [10]:
# ahora el indice vulve al original y la columna N_regs de nuevo pasa a ser una column
df

   N_regs    Name        Position  Age
0       1   Diana         Teacher   25
1       2  Karime    Data Analyst   25
2       3    Lain  Pc master race   22
3       4    Jane        Security   22

### para cambiar el numero de filas y columnas por defecto a mostrar.

In [11]:
# esto cambia el numero de filas a mostrar
pd.set_option('display.max_rows', 100)
# este cambia el numero de columnas a mostrar
pd.set_option('display.max_columns', 100)

### Hacer sort en los indices

In [12]:
# por defecto es True, retornar los valores en el orden actual
df.sort_index()

   N_regs    Name        Position  Age
0       1   Diana         Teacher   25
1       2  Karime    Data Analyst   25
2       3    Lain  Pc master race   22
3       4    Jane        Security   22

In [13]:
df.sort_index(ascending=False)

   N_regs    Name        Position  Age
3       4    Jane        Security   22
2       3    Lain  Pc master race   22
1       2  Karime    Data Analyst   25
0       1   Diana         Teacher   25